Тест/Тест/src/Catalogs/Клиенты/Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Клиенты</name>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитТелефон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Область</name>
    <type>
      <types>CatalogRef.Область</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город2</name>
    <type>
      <types>CatalogRef.Город</types>
    </type>
  </attributes>
  <attributes>
    <name>Страна2</name>
    <type>
      <types>CatalogRef.Страна</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастноеЛицо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОдост</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Паспорт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Прописка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефониДост</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортВыданКем</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортВыданДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлиента</name>
    <type>
      <types>EnumRef.дт_ТипыКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсрочкаПлатежаВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникОбращения</name>
    <type>
      <types>CatalogRef.ИсточникиОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоАвтомобилей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКлиента</name>
    <type>
      <types>CatalogRef.ВидыКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусКлиента</name>
    <type>
      <types>CatalogRef.СтатусыКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоКонтакта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролерЗвонков</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонПоиск</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>23</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Целевой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАвто</name>
    <type>
      <types>EnumRef.ТипАвтомобиляКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаАвто</name>
    <type>
      <types>CatalogRef.МаркиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СфераДеятельности</name>
    <type>
      <types>CatalogRef.СферыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерКомпании</name>
    <type>
      <types>CatalogRef.РазмерыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТехники</name>
    <type>
      <types>CatalogRef.ТипыТехники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоследнейЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПоследнейЗаявки</name>
    <type>
      <types>EnumRef.дт_СостоянияЗаказовКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоследнейЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПоПарку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочтительныйВидСвязи</name>
    <type>
      <types>CatalogRef.ПредпочтительныеВидыСвязи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредОтветственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеКлиента</name>
    <type>
      <types>EnumRef.СостояниеКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановкиОтветственного</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтовыйАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверкаИНН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрИнтервалЗакупа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоКонтактаКонтролера</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсталосьДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяДатаКонтролер</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВТСпасибо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КовбойМальборо</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлиентДолжностьРуководителя</name>
    <type>
      <types>EnumRef.ДолжностиРуководителяКлиент</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйНомер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерезвонилиПослеДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоКонтактаКуратор</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусКлиентаКолЦентр</name>
    <type>
      <types>EnumRef.СтатусыКлиентаКолЦентра</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоОбзвонаКолЦентра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСМСРассылки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Машины</name>
    <attributes>
      <name>Машина</name>
      <type>
        <types>CatalogRef.МашиныКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеКонтакты</name>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Дополнительно</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛПР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВТСпасибо</name>
    <attributes>
      <name>Покупатель</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Продажа</name>
      <type>
        <types>DocumentRef.ПродажаЗапчастей</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоСПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БонусыКлиента</name>
    <attributes>
      <name>Продажа</name>
      <type>
        <types>DocumentRef.ПродажаЗапчастей</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Бонусы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Списаны</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусовДоСписания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/CommonModules/ПродажиСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПараметрыЗаполненияВременнойТаблицыТоваров() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПересчитыватьВВалютуРегл", Ложь);
	СтруктураПараметров.Вставить("ВключаяНомераГТД", Ложь);
	СтруктураПараметров.Вставить("ВключаяДоКорректировки", Ложь);
	СтруктураПараметров.Вставить("АктуализироватьРасчеты", Истина);
	СтруктураПараметров.Вставить("ВключатьУслуги", Истина);
	СтруктураПараметров.Вставить("ВключатьТоварыНаКомиссии", Истина);
	
	Возврат СтруктураПараметров;
	
КонецФункции

Процедура СброситьФлагПерезвонилиУКлиента() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПродажаЗапчастей.Клиент КАК Клиент
	|ПОМЕСТИТЬ КлиентыПолучившиеДоставку
	|ИЗ
	|	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
	|ГДЕ
	|	(ПродажаЗапчастей.ЕстьДоставка
	|	И ПродажаЗапчастей.ДатаПолучения МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|	ИЛИ (ПродажаЗапчастей.Самовывоз
	|	И ПродажаЗапчастей.ДатаОтгрузкиСоСклада МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|СГРУППИРОВАТЬ ПО
	|	ПродажаЗапчастей.Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Клиенты.Ссылка КАК Клиент
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	НЕ Клиенты.Ссылка В
	|		(Выбрать
	|			КлиентыПолучившиеДоставку.Клиент
	|		Из
	|			КлиентыПолучившиеДоставку КАК КлиентыПолучившиеДоставку)
	|	И Клиенты.ПерезвонилиПослеДоставки = ИСТИНА";

	ДатаВПрошлом  = НачалоДня(ТекущаяДата() - (24 * 60 * 60) * 10);

	Запрос.УстановитьПараметр("ДатаНачала", ДатаВПрошлом);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			КлиентОбъект = Выборка.Клиент.ПолучитьОбъект();
			КлиентОбъект.ПерезвонилиПослеДоставки = Ложь;
			КлиентОбъект.Записать();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
